// 3. Створити два довільні масиви:
//    один масив - улюблена спортивна команда / моделі автомобілів / міста,
//     у другому – кількість гравців у команді / обсяг двигуна / кількість мешканців у місті.
//    З двох масивів зробіть асоціативний масив(об'єкт).
//    Масив, який виступатиме як ключ - повинен містити унікальні значення

//    Наприклад:
//         let keys = ["id", "name"];
// let values = [1, "Vlad"];

//    В результаті має вийде таке:
// {
//     "id": 1,
//         "name": "Vlad";
// }

const cars = ['Honda', 'Subaru', 'Mazda', 'Toyota', 'Nissan'];
const engine = [2, 3.2, 1.6, 2.4, 1.8];
const result = {};

for (let i = 0; i < cars.length; i++) {
    result[cars[i]] = engine[i];
}

console.log(result);